<a href="https://colab.research.google.com/github/yulandariarsyad/Pusat-Studi-Data-Sains-UAD/blob/main/Pivot_Table_%26_Combine_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Fungsi Groupby

mengelompokkan DataFrame menggunakan mapper atau dengan serangkaian kolom. Operasi grup by melibatkan beberapa kombinasi dari pemisahan objek, penerapan fungsi, dan penggabungan hasil.

In [ ]:
import pandas as pd
df = pd.DataFrame({'Tumbuhan': ['Mawar', 'Mawar',
                              'Melati', 'Melati'],
                   'Harga': [10000., 15000., 5000., 6000.]})
df

  Tumbuhan    Harga
0    Mawar  10000.0
1    Mawar  15000.0
2   Melati   5000.0
3   Melati   6000.0

Indeks Hierarki

merupakan pengelompokkan berdasarkan level yang berbeda dari indeks hierarki menggunakan parameter level

In [ ]:
df.groupby(['Tumbuhan']).mean()

            Harga
Tumbuhan
Mawar     12500.0
Melati     5500.0

Fungsi Dropna

jika true, dan jika kunci grup berisi nilai NA, nilai NA bersama dengan baris atau colom akan dibuang. jika false nilai NA juga akan diperlakukan sebagai fungsi dalam group.

In [ ]:
arrays = [['Mawar', 'Mawar', 'Melati', 'Melati'],
          ['Merah', 'Merah', 'Putih', 'Putih']]
index = pd.MultiIndex.from_arrays(arrays, names=('Tumbuhan', 'Type'))
df = pd.DataFrame({'Harga': [5000., 7000., 8000., 4000.]},
                  index=index)
df

                 Harga
Tumbuhan Type
Mawar    Merah  5000.0
         Merah  7000.0
Melati   Putih  8000.0
         Putih  4000.0

In [ ]:
df.groupby(level=0).mean()

           Harga
Tumbuhan
Mawar     6000.0
Melati    6000.0

In [ ]:
df.groupby(level="Type").mean()

        Harga
Type
Merah  6000.0
Putih  6000.0

In [ ]:
l = [[8, 4, 3], [2, None, 4], [2, 7, 1], [1, 2, 2]]
df = pd.DataFrame(l, columns=["a", "b", "c"])
df.groupby(by=["b"]).sum()

     a  c
b
2.0  1  2
4.0  8  3
7.0  2  1

In [ ]:
df.groupby(by=["b"], dropna=False).sum()

     a  c
b
2.0  1  2
4.0  8  3
7.0  2  1
NaN  2  4

In [ ]:
l = [["a", 12, 12], [None, 12.3, 33.], ["b", 12.3, 123], ["a", 1, 1]]
df = pd.DataFrame(l, columns=["a", "b", "c"])
df.groupby(by="a").sum()

      b      c
a
a  13.0   13.0
b  12.3  123.0

In [ ]:
df.groupby(by="a", dropna=False).sum()

        b      c
a
a    13.0   13.0
b    12.3  123.0
NaN  12.3   33.0

#Pivot Tabel untuk Python DataFrame
digunakan sebagai alternatif untuk melakukan analisis data terkait mengelompokkan dan meringkas data. Dengan menggunakan Pivot Table, pengguna dapat menghemat waktu secara signifikan.

In [ ]:
import pandas as pd
import numpy as np
#membuat data frame
df = pd.DataFrame({'angka': ['satu', 'satu', 'satu', 'dua', 'dua',
                           'dua'],
                   'huruf': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'angka1': [1, 2, 3, 4, 5, 6],
                   'huruf1': ['x', 'y', 'z', 'q', 'w', 't']})
print(df)

  angka huruf  angka1 huruf1
0  satu     A       1      x
1  satu     B       2      y
2  satu     C       3      z
3   dua     A       4      q
4   dua     B       5      w
5   dua     C       6      t

In [ ]:
df.pivot(index='angka', columns='huruf', values='angka1')
#angka akan berlaku sebagai index, tetapi nilai elemen yang sama akan ditampilkan salah satunya saja
#huruf akan berlaku sebagai column, tetapi nilai elemen yang sama akan ditampilkan salah satunya saja
#angka1 akan berlaku sebagai value

huruf  A  B  C
angka
dua    4  5  6
satu   1  2  3

In [ ]:
#meringkas nilai2 dari 'angka' dan 'huruf' terhadap 'angka1'
df.pivot(index='angka', columns='huruf')['angka1']

huruf  A  B  C
angka
dua    4  5  6
satu   1  2  3

In [ ]:
#meringkas nilai2 dari 'angka' dan 'huruf' terhadap 'angka1' dan 'huruf1'
df.pivot(index='angka', columns='huruf', values=['angka1', 'huruf1'])

      angka1       huruf1
huruf      A  B  C      A  B  C
angka
dua        4  5  6      q  w  t
satu       1  2  3      x  y  z

In [ ]:
#membuat data frame baru
df1 = pd.DataFrame({
       "x1": [1, 1, 1, 2, 2, 2],
       "x2": [1, 1, 2, 1, 1, 2],
       "x3": [1, 2, 1, 2, 1, 2],
       "x4": [1, 2, 3, 4, 5, 6],
       "nilai": [0, 1, 2, 3, 4, 5]})
df1

   x1  x2  x3  x4  nilai
0   1   1   1   1      0
1   1   1   2   2      1
2   1   2   1   3      2
3   2   1   2   4      3
4   2   1   1   5      4
5   2   2   2   6      5

In [ ]:
#meringkas df1 dengan x1 sebagai index, x2 dan x3 sebagai column, dan nilai sebagai valuenya
df1.pivot(index="x1", columns=["x2", "x3"],values="nilai")

x2    1         2
x3    1    2    1    2
x1
1   0.0  1.0  2.0  NaN
2   4.0  3.0  NaN  5.0

In [ ]:
#meringkas df1 dengan x1 sebagai index, x2 dan x3 sebagai column, dan nilai sebagai valuenya
df1.pivot(index=["x1", "x2"], columns=["x3"],values="nilai")

x3       1    2
x1 x2
1  1   0.0  1.0
   2   2.0  NaN
2  1   4.0  3.0
   2   NaN  5.0

# Merger DataFrame
Merger DataFrame artinya menggabungkan dua buah DataFrame secara berdampingan berdasarkan Kolom.

In [ ]:
import pandas as pd
d1 = {'no' : [1,2,3,4,5,6],
      'Nama' : ['Dyiyah','Mei','Berlin','Rivaldi','Rahma','Dhenok']}
df1 = pd.DataFrame(d1)
df1

   no     Nama
0   1   Dyiyah
1   2      Mei
2   3   Berlin
3   4  Rivaldi
4   5    Rahma
5   6   Dhenok

In [ ]:
d2 = {'no' :[1,2,3,4,5,6],
      'P/L' : ['P','P','P','L','P','P']}
df2 = pd.DataFrame(d2)
df2

   no P/L
0   1   P
1   2   P
2   3   P
3   4   L
4   5   P
5   6   P

Proses Merger

In [ ]:
df = pd.merge(df1, df2, left_index=True, right_index=True)
df

   no_x     Nama  no_y P/L
0     1   Dyiyah     1   P
1     2      Mei     2   P
2     3   Berlin     3   P
3     4  Rivaldi     4   L
4     5    Rahma     5   P
5     6   Dhenok     6   P

fungsi on

Menggabungkan df1 dan df2 dengan mengambil irisan dari kolom yang ingin di iriskan.

In [ ]:
df = pd.merge(df1, df2, on='no')
df

   no     Nama P/L
0   1   Dyiyah   P
1   2      Mei   P
2   3   Berlin   P
3   4  Rivaldi   L
4   5    Rahma   P
5   6   Dhenok   P

In [ ]:
import pandas as pd
d1 = {'no' : [1,2,3,4,5,6],
      'Nama' : ['Dyiyah','Mei','Berlin','Rivaldi','Rahma','Dhenok']}
df1 = pd.DataFrame(d1)
df1

   no     Nama
0   1   Dyiyah
1   2      Mei
2   3   Berlin
3   4  Rivaldi
4   5    Rahma
5   6   Dhenok

In [ ]:
d2 = {'no' :[1,2,3,4],
      'P/L' : ['P','P','P','L']}
df2 = pd.DataFrame(d2)
df2

   no P/L
0   1   P
1   2   P
2   3   P
3   4   L

Perhatikan bahwa penggabungan kolom yang muncul hanya pada sampai no.4, karena df1 dan df2 hanya memiliki irisan yaitu (1,2,3,4)

In [ ]:
df = pd.merge(df1, df2, on='no')
df

   no     Nama P/L
0   1   Dyiyah   P
1   2      Mei   P
2   3   Berlin   P
3   4  Rivaldi   L

Untuk menggabungkan kolom dengan jumlah yang berbeda, digunakan fungsi how='outer'

In [ ]:
df = pd.merge(df1, df2, on='no', how='outer')
df

   no     Nama  P/L
0   1   Dyiyah    P
1   2      Mei    P
2   3   Berlin    P
3   4  Rivaldi    L
4   5    Rahma  NaN
5   6   Dhenok  NaN

untuk menggabungkan kolom 'no' pada df1 dengan irisan 'no' dari df1 dan df2, digunakan how='left'

In [ ]:
df = pd.merge(df1, df2, on='no', how='left')
df

   no     Nama  P/L
0   1   Dyiyah    P
1   2      Mei    P
2   3   Berlin    P
3   4  Rivaldi    L
4   5    Rahma  NaN
5   6   Dhenok  NaN

In [ ]:
df = pd.merge(df1, df2, on='no', how='right')
df

   no     Nama P/L
0   1   Dyiyah   P
1   2      Mei   P
2   3   Berlin   P
3   4  Rivaldi   L

In [ ]:
df = pd.merge(df1, df2, on='no', how='outer', indicator=True)
df

   no     Nama  P/L     _merge
0   1   Dyiyah    P       both
1   2      Mei    P       both
2   3   Berlin    P       both
3   4  Rivaldi    L       both
4   5    Rahma  NaN  left_only
5   6   Dhenok  NaN  left_only

# Join DataFrame
join DataFrame adalah menggabungkan kolom dengan DataFrame lain baik di indeks atau di kolom kunci. menggabungkan beberapa objek DataFrame secara efisien dengan indeks sekaligus dengan meneruskan daftar. Untuk menggabungkan tersebut harus di siapkan lebih dahulu data dalam bentuk csv atau bisa di import secara manual. sekarang kita akan mempelajari Join DataFrame dengan menggunakan data csv.

Berikut cara untuk menjalankan Join DataFrame:

In [ ]:
import pandas as pd
import numpy as np

Input dataFrame

In [ ]:
data = pd.DataFrame(
    {
        'ID Mahasiswa': ['1111','1112','1113','1114','1115','1116'],
        'Nama Mahasiswa': ['Muhammad Rivaldi', 'Berlin Putr', 'Rika Mei Sari', 'Dhenok', 'Dyiyah Kresna', 'Rahmawati']
    },
     columns=['ID Mahasiswa','Nama Mahasiswa'],
)
data

  ID Mahasiswa    Nama Mahasiswa
0         1111  Muhammad Rivaldi
1         1112       Berlin Putr
2         1113     Rika Mei Sari
3         1114            Dhenok
4         1115     Dyiyah Kresna
5         1116         Rahmawati

selanjutnya input data lain

In [ ]:
other = pd.DataFrame(
    {
        'Nilai Mahasiswa': ['89', '88', '90', '87', '85', '86']
    },
    columns=['Nilai Mahasiswa'],
)
other

  Nilai Mahasiswa
0              89
1              88
2              90
3              87
4              85
5              86

menggabungkan atau join dataFrame dengan data lain

In [ ]:
data.join(other, lsuffix='_caller', rsuffix='_other')

  ID Mahasiswa    Nama Mahasiswa Nilai Mahasiswa
0         1111  Muhammad Rivaldi              89
1         1112       Berlin Putr              88
2         1113     Rika Mei Sari              90
3         1114            Dhenok              87
4         1115     Dyiyah Kresna              85
5         1116         Rahmawati              86

# Concatenate DataFrame 
operasi penggabungan dari dua kumpulan data yang berbeda menjadi satu data hingga penggabungan gaya database yang lebih rumit.

**Anda dapat mulai dengan import standar**

In [ ]:
import pandas as pd
import numpy as np

**Membuat DataFrame berdasarkan data yang diperoleh atau diketahui
misalkan seperti dibawah ini**

In [ ]:
def make_df(cols, line):
#Buatlah data
    data = {a: [str(a) + str(i) for i in line]
            for a in cols}
    return pd.DataFrame(data, line)
make_df('ABC', range(4)) #Panjang line

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

**Setelah itu untuk dapat menggabungkan objek berdimensi lebih tinggi, seperti DataFrames dengan pd.concat:**

In [ ]:
df1 = make_df('AB', [1, 2]) 
df2 = make_df('AB', [3, 4])
display('df1', 'df2', 'pd.concat([df1, df2])')

'df1'

'df2'

'pd.concat([df1, df2])'

**Penggabungan dapat dilakukan secara baris dalam DataFrame (yaitu, axis = 0). Seperti np.concatenate, pd.concat memungkinkan spesifikasi sumbu di mana penggabungan akan berlangsung. Perhatikan contoh berikut:**

*Anda dapat menentukan axis = 1 secara ekuivalen; di sini kita telah menggunakan axis = 'col' yang lebih intuitif.*

In [ ]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
display('df3', 'df4', "pd.concat([df3, df4], axis='1')")

'df3'

'df4'

"pd.concat([df3, df4], axis='1')"

***Duplikat Indek***


Dimana satu perbedaan penting antara np.concatenate dan pd.concat adalah bahwa penggabungan Pandas mempertahankan indeks, meskipun hasilnya akan memiliki indeks duplikat! Pertimbangkan contoh sederhana ini:

In [ ]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index  # membuat duplikat indek
display('x', 'y', 'pd.concat([x, y])')

'x'

'y'

'pd.concat([x, y])'

In [ ]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
x.index = y.index  # membuat duplikat indek 
display('x', 'y', 'pd.concat([x, y])')

'x'

'y'

'pd.concat([x, y])'

**Menambahkan kunci MultiIndex**

Opsi lainnya adalah menggunakan opsi kunci untuk menentukan label untuk sumber data, hasilnya akan menjadi seri yang diindeks secara hierarki yang berisi data:

In [ ]:
display('x', 'y', "pd.concat([x, y], keys=['x', 'y'])")

'x'

'y'

"pd.concat([x, y], keys=['x', 'y'])"

**Penggabungan dengan gabungan**

Dalam contoh sederhana diatas, terutama menggabungkan DataFrames dengan nama kolom bersama. Dalam praktiknya, data dari sumber yang berbeda mungkin memiliki kumpulan nama kolom yang berbeda, dan pd.concat menawarkan beberapa opsi dalam kasus ini. Pertimbangkan penggabungan dari dua DataFrames berikut, yang memiliki beberapa (tapi tidak semua) Kolom yang sama:

In [ ]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
display('df5', 'df6', 'pd.concat([df5, df6])')

'df5'

'df6'

'pd.concat([df5, df6])'

**Menambahkan append() metode

Karena penggabungan array langsung sangat umum, objek Series dan DataFrame memiliki metode penambahan yang dapat menyelesaikan hal yang sama dengan penekanan tombol yang lebih sedikit. Misalnya, daripada memanggil pd.concat ([df1, df2]), Anda cukup memanggil df1.append (df2):**

In [ ]:
display('df1', 'df2', 'df1.append(df2)')

'df1'

'df2'

'df1.append(df2)'

# Compare DataFrame

compare dataframe adalah perbandingan dataframe yang menunjukan perbedaan yang ditumpuk berdampingan

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame(
    {
        "bagian1": ["a", "a", "b", "b", "a"],
        "bagian2": [1.0, 2.0, 3.0, np.nan, 5.0],
        "bagian3": [1.0, 2.0, 3.0, 4.0, 5.0]
    },
    columns=["bagian1", "bagian2", "bagian3"],
)
df

  bagian1  bagian2  bagian3
0       a      1.0      1.0
1       a      2.0      2.0
2       b      3.0      3.0
3       b      NaN      4.0
4       a      5.0      5.0

mensejajarkan perbedaan dalam kolom

In [ ]:
df2 = df.copy()
df2.loc[0, 'bagian1'] = 'c'
df2.loc[2, 'bagian3'] = 4.0
df

  bagian1  bagian2  bagian3
0       a      1.0      1.0
1       a      2.0      2.0
2       b      3.0      3.0
3       b      NaN      4.0
4       a      5.0      5.0

Menumpuk perbedaan pada baris

In [ ]:
df.compare(df2)

  bagian1       bagian3
     self other    self other
0       a     c     NaN   NaN
2     NaN   NaN     3.0   4.0

fungsi align_axix

fungsi ini digunakan untuk merataka perbandingan baris dan kolom

In [ ]:
df.compare(df2, align_axis=0)

        bagian1  bagian3
0 self        a      NaN
  other       c      NaN
2 self      NaN      3.0
  other     NaN      4.0

fungsi keep_equal 

Jika true, hasilnya mempertahankan nilai yang sama. Jika tidak, nilai yang sama akan ditampilkan sebagai NaN

In [ ]:
df.compare(df2, keep_equal=True)

  bagian1       bagian3
     self other    self other
0       a     c     1.0   1.0
2       b     b     3.0   4.0

fungsi keep_shape

Jika true, semua baris dan kolom disimpan. Jika tidak, hanya yang memiliki nilai berbeda yang disimpan

In [ ]:
df.compare(df2, keep_shape=True)

  bagian1       bagian2       bagian3
     self other    self other    self other
0       a     c     NaN   NaN     NaN   NaN
1     NaN   NaN     NaN   NaN     NaN   NaN
2     NaN   NaN     NaN   NaN     3.0   4.0
3     NaN   NaN     NaN   NaN     NaN   NaN
4     NaN   NaN     NaN   NaN     NaN   NaN

In [ ]:
df.compare(df2, keep_shape=True, keep_equal=True)

  bagian1       bagian2       bagian3
     self other    self other    self other
0       a     c     1.0   1.0     1.0   1.0
1       a     a     2.0   2.0     2.0   2.0
2       b     b     3.0   3.0     3.0   4.0
3       b     b     NaN   NaN     4.0   4.0
4       a     a     5.0   5.0     5.0   5.0